package study;


public class Study_231018 {
	public static void main(String[]args) {
		System.out.println("혼자 복습 다시하는 자바, 지금 시작합니다.");
		
		
//		println 을 사용할때는 큰따옴표를 잘 사용해야한다. \n 큰 따옴표 내의 글 또는 숫자는 그 자체로 출력이 된다. 한번 시도해보자.");
//		먼저 일반적인 문장이다. 사실 이것도 큰따옴표 안에 있는 문장이다. 영어도 가능하다. eng  shiroyo :) ");
//		물론 숫자도 가능하다. 1234567890 전부 가능하다. \n 하지만 이 안에서는 수 끼리의 연산이 불가능하다. 1+3 은 식 그대로만 출력이 된다.");
//		그럼 연산은 어떻게 해야할까? 단순하다 큰 따옴표 밖으로 빼면 그만이다." + 3 + 6 + "이러면 나오는 결과는 9로만 나온다 ㅋㅋㄹㅃㅃ "
//		단, 주의점이 있는데. 큰따옴표 이후 또는 사이에 수식의 연산이 포함 된 경우에는 수식과 큰 따옴표 사이에 + 부호를 꼭 넣어줘야한다." );
//		자 그럼 이걸 이용해서 간단한 수식을 계산하는 텍스트를 만들어보자. 누구나 1+1은 2라는것을 안다. 이것을 그대로 출력해보자.");
		System.out.println(1+1);
//		"왜 안나온줄 아는가? 분명 나는 큰 따옴표 안에 있어야지만 그대로 출력 된다고 했다. 다시 해보자.
		System.out.println("1 + 1 =" + "2"); // 라고 하면 정확하게 수식과 답이 같이 나온다. 바로 이거다.
	}	

}
